# Copyright (C) 2005-2011 Splunk Inc. All Rights Reserved.

#############################################
#     Cisco Security Overview Dashboard     #
#############################################

[Cisco IPS Global Threat Correlation - DataCube]
# Used in gc_overview.xml
is_visible = false
search = eventtype=cisco_ips gc_score<0 | bin _time span=5m | geoip src_ip | rename src_ip_country_name AS client_country | stats count by gc_score, client_country, description, attacker, target, hostId, _time
#enableSched = 1
#cron_schedule = 0 */3 * * *
#dispatch.earliest_time = -6h
#dispatch.latest_time = +0s
#search = eventtype=cisco_ips gc_score<0 | bin _time span=5m | lookup geoip clientip as src_ip | stats count by gc_score, client_country, mars_category, description, attacker, target, hostId, _time

[Cisco Botnet Filter - DataCube]
# Used in botnet_overview.xml
is_visible = false
search = eventtype=firewall-botnet-filter | bin _time span=5m | geoip dest_ip | rename dest_ip_country_name AS client_country | stats count by client_country, dest_ip, src_ip, protocol, botnet_action, _time, _geo
#enableSched = 1
#cron_schedule = 0 */3 * * *
#dispatch.earliest_time = -6h
#dispatch.latest_time = +0s
#search = eventtype=firewall-botnet-filter | bin _time span=5m | lookup geoip clientip as dest_ip | stats count by client_lat, client_lon, client_city, client_region, client_country, dest_ip, src_ip, protocol, botnet_action, _time

####################################
#     Cisco Firewall Dashboard     #
####################################

[Cisco Firewall - DataCube]
#Used in firewall_overview.xml
is_visible = false
search = `cisco_firewall` |  bin _time span=5m | stats count by eventtype, src_ip, dest_ip, host,log_level_desc,event_desc, _time
#enableSched = 1
#cron_schedule = 0 */3 * * *
#dispatch.earliest_time = -12h
#dispatch.latest_time = +0s

[Cisco Firewall - DataCube - Summary Index]
enableSched = 0
cron_schedule = 0 */6 * * *
dispatch.earliest_time = -6h
dispatch.latest_time = +0s
action.summary_index = 1
action.summary_index.marker = cisco_firewall
realtime_schedule = 0
search = eventtype=cisco_firewall | bin _time span=15m | sistats count by eventtype, src_ip, dest_ip, host,log_level_desc,event_desc, _time
is_visible = false

#######################################
# Example reports for Cisco Firewalls #
######################################

[Cisco Firewall - Actions Over Last 24 Hours]
enableSched = 0
cron_schedule = 0 0 * * *
action.email.sendresults = 0
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = eventtype=cisco_firewall | timechart count by eventtype

[Cisco Firewall - Denies Over Last 24 Hours]
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = eventtype=cisco_firewall eventtype=firewall-deny | timechart count by host 

[Cisco Firewall - Accepts Over Last 24 Hours]
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = eventtype=cisco_firewall eventtype=firewall-accept | timechart count by host 

[Cisco Firewall - Top Source IP]
dispatch.earliest_time = -6h
dispatch.latest_time = +0s
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = eventtype=cisco_firewall | top src_ip showperc=f

[Cisco Firewall - Top Destination IP]
dispatch.earliest_time = -6h
dispatch.latest_time = +0s
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = eventtype=cisco_firewall  | top dest_ip showperc=f

[Cisco Firewall Recent Events]
action.email.sendresults = 0
dispatch.earliest_time = -6h@h
dispatch.latest_time = +0s
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = eventtype=cisco_firewall

###############################
#     Cisco IPS Dashboard     #
###############################

[Cisco IPS - DataCube]
#Used in ips_overview.xml
enableSched = 0
is_visible = false
search = `cisco_ips` | bin _time span=5m | stats count by  severity, description, attacker, target, hostId, _time

[Cisco IPS - DataCube - Summary Index]
enableSched = 0
cron_schedule = 0 */6 * * *
dispatch.earliest_time = -6h
dispatch.latest_time = +0s
action.summary_index = 1
action.summary_index.marker = cisco_ips
realtime_schedule = 0
search = eventtype="cisco_ips" | bin _time span=15m | sistats count by  severity, description, attacker, target, hostId, _time
is_visible = false

[Cisco IPS - Count by Mars Category] 
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
displayview = flashtimeline
search = eventtype=cisco_ips | top mars_category showperc=f

[Cisco IPS - Count by Severity] 
enableSched = 0
cron_schedule = 0 0 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
displayview = flashtimeline
search = eventtype=cisco_ips | top severity showperc=f

[Cisco IPS - Count by Signature] 
enableSched = 0
cron_schedule = 0 0 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
displayview = flashtimeline
search = eventtype=cisco_ips | top description showperc=f

[Cisco IPS - Count by Source IP] 
enableSched = 0
cron_schedule = 0 0 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
displayview = flashtimeline
search = eventtype=cisco_ips | top attacker showperc=f

[Cisco IPS - Count by Dest IP] 
enableSched = 0
cron_schedule = 0 0 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
displayview = flashtimeline
search = eventtype=cisco_ips | top target showperc=f

[Cisco IPS - IPS Stats] 
enableSched = 0
cron_schedule = 0 0 * * *
dispatch.earliest_time = -12h
dispatch.latest_time = +0s
displayview = flashtimeline
search = eventtype=cisco_ips description!="" | dedup description | stats list(description) list(attacker) list(target) by severity

###################################################
#     Cisco Ironport Email Security Dashboard     #
###################################################

[Cisco IronPort E-mail - DataCube]
# Used in esa_overview.xml
enableSched = 0
#cron_schedule = 10 */6 * * *
#dispatch.earliest_time = -24h
#dispatch.latest_time = +0s
is_visible = false
search = eventtype=cisco_esa | transaction maxspan=180s mid dcid icid | stats count by mailfrom, mailto, _time 

[IronPort E-mail - E-mail Transactions]
enableSched = 0
cron_schedule = 0 0 * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = eventtype=cisco_esa | transaction  mid dcid icid

[IronPort E-mail - Top Sender]
enableSched = 0
cron_schedule = 0 0 * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = eventtype=cisco_esa mailfrom=* |  top limit=10 mailfrom showperc=f

[IronPort E-mail - Top Receiver]
enableSched = 0
cron_schedule = 0 0 * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = eventtype=cisco_esa mailto=*  | top limit=10 mailto showperc=f

#################################################
#     Cisco Ironport Web Security Dashboard     #
#################################################

###  WSA Overview Data Cubes ###
   
[Cisco WSA - Acceptable Use - DataCube]
# Used in wsa_acceptable_use_business.xml, wsa_acceptable_use_personal.xml, wsa_acceptable_use_legal.xml, wsa_acceptable_use_tools.xml
enableSched = 0
#cron_schedule = 0 */3 * * *
#dispatch.earliest_time = -24h
#dispatch.latest_time = +0s
is_visible = false
search = eventtype="ironport_proxy" c_ip=* | rex field=cs_url "\/\/(?P<s_hostname>[^/]*)" | bin _time span=5m |  stats count by usage s_hostname,cs_username, c_ip, x_webcat_code_full, _time

[Cisco WSA - Security - DataCube]
# Used in wsa_overview.xml, wsa_security.xml
enableSched = 0
#cron_schedule = 30 */3 * * *
#dispatch.earliest_time = -24h
#dispatch.latest_time = +0s
is_visible = false
search = eventtype="ironport_proxy" c_ip=* | rex field=cs_url "\/\/(?P<s_hostname>[^/]*)"  | bin _time span=5m | stats count by usage, severity, x_webroot_threat_name, x_wbrs_score, s_hostname, cs_username, c_ip, x_webcat_code_full, _time

[Cisco WSA - Network Resources - DataCube]
# Used in wsa_network_resources.xml
enableSched = 0
#cron_schedule = 45 */3 * * *
#dispatch.earliest_time = -24h
#dispatch.latest_time = +0s
is_visible = false
search = eventtype="ironport_proxy" c_ip=* | rex field=cs_url "\/\/(?P<s_hostname>[^/]*)" | bin _time span=5m | stats count by sc_bytes, s_hostname, cs_username, c_ip, x_webcat_code_full,usage , _time

### WSA Overview Searches ###

[Cisco WSA - Events over time by Usage]
enableSched = 0
cron_schedule = 0 1 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
search = eventtype=ironport_proxy  | timechart count by usage

[Cisco WSA - Top Categories]
enableSched = 0
cron_schedule = 0 1 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
search = eventtype=ironport_proxy | stats count by x_webcat_code_full

[Cisco WSA - Top Clients]
enableSched = 0
cron_schedule = 0 1 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
search =  eventtype=ironport_proxy | stats count by c_ip

[Cisco WSA - Top Websites]
enableSched = 0
cron_schedule = 0 1 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
search = eventtype=ironport_proxy | rex field=cs_url "\/\/(?P<s_hostname>[^/]*)" | stats count by s_hostname

### WSA Acceptable Use Searches ###
### Business Usage ###

[Cisco WSA - Acceptable Use - Business - Web Traffic Over Time]
enableSched = 0
cron_schedule = 0 2 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
search =  eventtype=ironport_proxy | eval usage = if(usage == "Business", "Business Usage", "Other") |  timechart max(sc_bytes) by usage

[Cisco WSA - Acceptable Use - Business - Web Traffic by Category]
enableSched = 0
cron_schedule = 0 2 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
search =   eventtype=ironport_proxy usage="Business"| stats count by x_webcat_code_full | head 10 | sort -count

[Cisco WSA - Acceptable Use - Business - Web Traffic by Client]
enableSched = 0
cron_schedule = 0 2 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
search =  eventtype=ironport_proxy usage="Business"| stats count by c_ip | head 10 | sort -count

[Cisco WSA - Acceptable Use - Business - Web Traffic by User]
enableSched = 0
cron_schedule = 0 2 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
search =  eventtype=ironport_proxy usage="Business"| stats count by cs_username | sort -count

[Cisco WSA - Acceptable Use - Business - Web Traffic by Website]
enableSched = 0
cron_schedule = 0 2 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
search =  eventtype=ironport_proxy usage="Business" | rex field=cs_url "\/\/(?P<s_hostname>[^/]*)" | stats count by s_hostname | sort -count | head 10

[Cisco WSA - Acceptable Use - Business - Recent Events]
enableSched = 0
cron_schedule = 0 2 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = eventtype=ironport_proxy usage="Business"

### Productivity Loss ###

[Cisco WSA - Acceptable Use - Personal - Web Traffic Over Time]
enableSched = 0
cron_schedule = 0 3 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
search =  eventtype=ironport_proxy  | eval usage = if(usage == "Personal", "Personal Use", "Other") |  timechart count(_raw) as Requests by usage

[Cisco WSA - Acceptable Use - Personal - Web Traffic by Category]
enableSched = 0
cron_schedule = 0 3 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
search =  eventtype=ironport_proxy  usage="Personal"| stats count by x_webcat_code_full | sort -count | head 10

[Cisco WSA - Acceptable Use - Personal - Web Traffic by Client]
enableSched = 0
cron_schedule = 0 3 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
search =  eventtype=ironport_proxy  usage="Personal"| stats count by c_ip 

[Cisco WSA - Acceptable Use - Personal - Web Traffic by User]
enableSched = 0
cron_schedule = 0 3 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
search =  eventtype=ironport_proxy usage="Personal"| stats count by cs_username

[Cisco WSA - Acceptable Use - Personal - Web Traffic by Website]
enableSched = 0
cron_schedule = 0 3 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
search =  eventtype=ironport_proxy  usage="Personal" | rex field=cs_url "\/\/(?P<s_hostname>[^/]*)" | stats count by s_hostname

[Cisco WSA - Acceptable Use - Personal - Recent Events]
enableSched = 0
cron_schedule = 0 3 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = eventtype=ironport_proxy usage="Personal" | dedup s_hostname | stats list(s_hostname) as "Sites Visited" count(_raw) as Requests by cs_username x_webcat_code_full | rename cs_username as "Employee Username"

### Legal Liability ###

[Cisco WSA - Acceptable Use - Liability - Web Traffic Over Time]
enableSched = 0
cron_schedule = 0 4 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
search =  eventtype=ironport_proxy usage="Violation" | timechart max(sc_bytes)

[Cisco WSA - Acceptable Use - Liability - Web Traffic by Category]
enableSched = 0
cron_schedule = 0 4 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
search =  eventtype=ironport_proxy  usage="Violation"| stats count by x_webcat_code_full

[Cisco WSA - Acceptable Use - Liability - Web Traffic by Client]
enableSched = 0
cron_schedule = 0 4 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
search =  eventtype=ironport_proxy usage="Violation"| stats count by c_ip 

[Cisco WSA - Acceptable Use - Liability - Web Traffic by User]
enableSched = 0
cron_schedule = 0 4 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
search =  eventtype=ironport_proxy  usage="Violation"| stats count by cs_username 

[Cisco WSA - Acceptable Use - Liability - Web Traffic by Website]
enableSched = 0
cron_schedule = 0 4 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
search =  eventtype=ironport_proxy usage="Violation" | rex field=cs_url "\/\/(?P<s_hostname>[^/]*)" | stats count by s_hostname

[Cisco WSA - Acceptable Use - Liability - Recent Events]
enableSched = 0
cron_schedule = 0 4 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = eventtype=ironport_proxy usage="Borderline" | dedup s_hostname | stats list(s_hostname) as "Web Site" dc(cs_username) as "Users"  by x_webcat_code_full | rename cs_username as "Employee Username" | rename x_webcat_code_full as "Site Category"

### Internet Tools ###

[Cisco WSA - Acceptable Use - Internet Tools - Web Traffic Over Time]
enableSched = 0
cron_schedule = 0 5 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
displayview = report_builder_display
request.ui_dispatch_view = report_builder_display
search = eventtype=ironport_proxy usage="Borderline" | timechart max(sc_bytes) by x_webcat_code_full
#vsid = *:g5q3cvke

[Cisco WSA - Acceptable Use - Internet Tools - Web Traffic by Category]
enableSched = 0
cron_schedule = 0 5 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
search =  eventtype=ironport_proxy usage="Borderline"| stats count by x_webcat_code_full

[Cisco WSA - Acceptable Use - Internet Tools - Web Traffic by Client]
enableSched = 0
cron_schedule = 0 5 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
search =  eventtype=ironport_proxy usage="Borderline"| stats count by c_ip 

[Cisco WSA - Acceptable Use - Internet Tools - Web Traffic by Website]
enableSched = 0
cron_schedule = 0 5 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
search =  eventtype=ironport_proxy usage="Borderline" | rex field=cs_url "\/\/(?P<s_hostname>[^/]*)" | stats count by s_hostname

[Cisco WSA - Acceptable Use - Internet Tools - Recent Events]
enableSched = 0
cron_schedule = 0 5 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = eventtype=ironport_proxy usage="Borderline"

### WSA Security Searches ###

[Cisco WSA - Security - Poor Categories]
enableSched = 0
cron_schedule = 0 1 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
search =  eventtype=ironport_proxy x_wbrs_score<6 | stats count by x_webcat_code_full

[Cisco WSA - Security - Poor Domains]
enableSched = 0
cron_schedule = 0 1 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
search =  eventtype=ironport_proxy x_wbrs_score<6 | rex field=cs_url "\/\/(?P<s_hostname>[^/]*)" | stats count by s_hostname

[Cisco WSA - Virus Detected]
enableSched = 0
cron_schedule = 0 1 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
search = eventtype=ironport_proxy x_mcafee_virus_name!="-" | top x_mcafee_virus_name

[Cisco WSA - Web Threats Detected]
enableSched = 0
cron_schedule = 0 1 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
search = eventtype=ironport_proxy  x_webroot_threat_name!="-" | top x_webroot_threat_name

### WSA Newtwork Resources Searches ###

[Cisco WSA - Network Resources - Bandwidth Over Time]
enableSched = 0
cron_schedule = 0 1 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
search =  eventtype=ironport_proxy  | timechart max(sc_bytes)

[Cisco WSA - Network Resources - Bandwidth by Category]
enableSched = 0
cron_schedule = 0 1 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
search =  eventtype=ironport_proxy | stats max(sc_bytes) by x_webcat_code_full

[Cisco WSA - Network Resources - Bandwidth by Client]
enableSched = 0
cron_schedule = 0 1 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
search =  eventtype=ironport_proxy | stats max(sc_bytes) by c_ip

[Cisco WSA - Network Resources - Bandwidth by Site]
enableSched = 0
cron_schedule = 0 1 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
search =  eventtype=ironport_proxy  | rex field=cs_url "\/\/(?P<s_hostname>[^/]*)" | stats max(sc_bytes) by s_hostname