[Global Security Events]
action.email.reportServerEnabled = 0
alert.track = 0
auto_summarize = 1
auto_summarize.dispatch.earliest_time = -1mon@d
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
display.events.fields = []
display.events.type = raw
display.general.type = statistics
display.visualizations.chartHeight = 542
display.visualizations.charting.chart = line
display.visualizations.show = 0
request.ui_dispatch_app = Splunk_CiscoSecuritySuite
request.ui_dispatch_view = search
search = sourcetype=cisco* src_ip!="10.0.0.0/8" src_ip!="172.12.0.0/12" src_ip!="192.168.0.0/16" src_ip!="0.0.0.0/32" | eval src=coalesce(src_ip,src_host) | eval dest=coalesce(dest_ip,dest_host) | iplocation src | geostats latfield=lat longfield=lon count by product
